function Q=kuka_inverse(T,TCP)
% Ðåøåíèå çàäà÷è èíâåðñíîé êèíåìàòèêè 
% Ôóíêöèÿ âîçâðàùàåò ìàòðèöó Q [8x6], ñîäåðæàùóþ 8 ðåøåíèé.

% Ïðèíÿòûå îáîçíà÷åíèÿ (ñèñòåìà êîîðäèíàò ðîáîòà ñ íà÷àëîì â åãî îñíîâàíèè):
% T - ìàòðèöà ïåðåõîäà (ìàòðèöà îäíîðîäíîãî ïðåîáðàçîâàíèÿ) [4 x 4]
% R - ìàòðèöà ïîâîðîòà [3 õ 3], R = T(1:3, 1:3)
% P - âåêòîð ïîëîæåíèÿ [3 x 1], P = T(1:3, 4)
% Èíäåêñû:
% 1..6 - çâåíüÿ ìàíèïóëÿòîðà (ïðèìåð: R3 - ìàòðèöà ïîâîðîòà òðåòüåãî çâåíà)
% f - ôëàíåö (ïðèìåð: Pf - ïîëîæåíèå ôëàíöà)
%
% F - ñèñòåìà êîîðäèíàò ôëàíöà (íà÷àëî â êîíå÷íîé òî÷êå ìàíèïóëÿòîðà)
% TCP (Tool Center Point) - îðèåíòàöèÿ è ïîëîæåíèå èíñòðóìåíòà â ñèñòåìå êîîðäèíàò ôëàíöà (ìàòðèöà îäíîðîäíîãî ïðåîáðàçîâàíèÿ) [4 x 4]


%% Ïàðàìåòðû êèíåìàòè÷åñêîé ìîäåëè ðîáîòà
% KUKA KR10 R1100    
link1=400;
offset12=25;
link2=560;
offset23=35;
link34=515; 
link56=80; 

% % KUKA KR10 R900 
% link2=455;
% link34=420;

F =[0 0 1 0; 0 1 0 0; -1 0 0 0; 0 0 0 1];  % ìàòðèöà ïåðåõîäà êîíå÷íîé òî÷êè ìàíèïóëÿòîðà èç ãëîáàëüíîé ñèñòåìû êîîðäèíàò â ñèñòåìó êîîðäèíàò ôëàíöà 
% axlim=[-170 170; -190 45; -120 156; -185 185; -120 120; -350 350]; 
% axspeed=[300 225 225 381 311 492];

%% 

% Îáîáùåíèå çâåíüåâ 3 è 4 ñ ó÷åòîì ñìåùåíèÿ offset23 (ÿâëÿþòñÿ êîíñòðóêòèâíûìè êîíñòàíòàìè äëÿ çàäàííîãî òèïà ìàíèïóëÿòîðà)
a=sqrt(offset23^2+link34^2);   % ñòîðîíà A â òåîðåìå êîñèíóñîâ
b=link2;                       % ñòîðîíà B â òåîðåìå êîñèíóñîâ
delta=atan2(offset23, link34); % óãëîâàÿ ïîïðàâêà 

Q=zeros(8,6);

% Ïåðåõîä îò êîîðäèíàò TCP ê ñîîòâåòñòâóþùèì êîîðäèíàòàì çàïÿñòüÿ  
Rf=T(1:3,1:3)*TCP(1:3,1:3)'; % ñèñòåìà êîîðäèíàò ôëàíöà â ãëîáàëüíîé ñèñòåìå
P6=T(1:3,4)-Rf*TCP(1:3,4);   % ïîëîæåíèå êîíå÷íîé òî÷êè ìàíèïóëÿòîðà â ãëîáàëüíîé ñèñòåìå êîîðäèíàò
R6=Rf*F(1:3,1:3)';           % îðèåíòàöèÿ êîíå÷íîé òî÷êè ìàíèïóëÿòîðà â ãëîáàëüíîé ñèñòåìå êîîðäèíàò

% Êîîðäèíàòû çàïÿñòüÿ (ñìåùÿåìñÿ îò ôëàíöà äî îñè ïÿòîãî øàðíèðà ïî îáðàòíîìó íàïðàâëåíèþ R6(:,1) (â ñèñòåìå êîîðäèíàò ðîáîòà â íóëåâîé êîíôèãóðàöèè îí "âûòÿíóò" â íàïðàâëåíèè X)
x4=P6(1)-link56*R6(1,1);
y4=P6(2)-link56*R6(2,1);
z4=P6(3)-link56*R6(3,1);

L=sqrt(x4^2+y4^2); % äëèíà ïðîåêöèè ðàññòîÿíèÿ äî çàäàííîé êîîðäèíàòû çàïÿñòüÿ íà ïëîñêîñòü xy â ñèñòåìå êîîðäèíàò ðîáîòà 

%% Îñü 1
Q(1:4,1)=atan2(y4,x4);  % ïåðåäîì: óãîë "íà öåëü"  % ñèíãóëÿðíîñòü, åñëè y4=x4=0 
if Q(1,1)>0             % çàäîì
    Q(5:8,1)=Q(1,1)-pi; 
else
    Q(5:8,1)=Q(1,1)+pi;
end 

%% Îñè 2 è 3
% ïåðåäîì
[theta, alpha, gamma, ~] = angles_for_q123(L-offset12, z4-link1, a, b);
Q(1:2,2) = -theta-alpha;    % ÷åðåç âåðõ (ëîêîòîòü ââåðõ)
Q(1:2,3) = pi-gamma+delta;
Q(3:4,2) = -theta+alpha;    % ÷åðåç íèç (ëîêîòü âíèç)
Q(3:4,3) = -pi+gamma+delta;

% çàäîì
[theta, alpha, gamma, ~] = angles_for_q123(L+offset12, z4-link1, a, b);
Q(5:6,2) = theta+alpha-pi;  % ÷åðåç âåðõ (ëîêîòîòü ââåðõ)
Q(5:6,3) = -pi+gamma+delta;
Q(7:8,2) = theta-alpha-pi;  % ÷åðåç íèç (ëîêîòü âíèç)
Q(7:8,3) = pi-gamma+delta;

%% Îñè 4, 5, 6
for i=1:2:7
    [q4, q5, q6] = q456(Q(i,1), Q(i,2), Q(i,3), R6);
    Q(i:i+1,4)=q4;
    Q(i:i+1,5)=q5;
    Q(i:i+1,6)=q6;
end


% íàïðàâëåíèå îñåé 1, 4 è 6 â ðîáîòå èíâåðòèðîâàíî
Q(:,1)=-Q(:,1);
Q(:,4)=-Q(:,4);
Q(:,6)=-Q(:,6);
Q=Q*180/pi;


function [q4, q5, q6] = q456(q1,q2,q3,R)
% Îñè 4, 5, 6 äëÿ ïîëîæèòåëüíîãî è îòðèöàòåëüíîãî óãëà â çàïÿñòüå
R = Ry(-q2-q3)*Rz(-q1)*R; % êîððåêöèÿ îðèåíòàöèè ñ ó÷åòîì óãëîâ q1..q3
if R(1,1)<1
    q5 = [1; -1]*acos(R(1,1));
    q6 = atan2([1; -1]*R(1,2),[1; -1]*R(1,3));
    q4 = atan2([1; -1]*R(2,1),-[1; -1]*R(3,1));
else % âòîðàÿ ñèíãóëÿðíîñòü 
    q5 = [0; 0];
    q4 = [0; 0];
    q6 = [1; 1]*atan2(R(3,2), R(3,3));   % atan2(R(3,2), R(3,3)); % ñóììà óãëîâ â îñÿõ 4 è 6
end


function [theta, alpha, gamma, ok] = angles_for_q123(L, z, a, b)
c = sqrt(L^2+z^2);            % ñòîðîíà C â òåîðåìå êîñèíóñîâ
cos_alpha = (b^2+c^2-a^2)/(2*b*c);
cos_gamma = (a^2+b^2-c^2)/(2*a*b);
ok = abs(cos_alpha)<=1 && abs(cos_gamma)>=1;    %  åñëè cos áîëüøå 1, òî ñîñòîÿíèå êèíåìàòè÷åñêè íåäîñòèæèìî (ñëèøêîì äàëåêî èëè ñëèøêîì áëèçêî) 
theta = atan2(z,L);             % íàêëîí îñíîâàíèÿ òðåóãîëüíèêà
alpha = real(acos(cos_alpha));  % óãîë àëüôà (â îñíîâàíèè ðîáîòà), áåðåì äåéñòâèòåëüíóþ ÷àñòü ÷èñëà íà ñëó÷àé, åñëè cos>1
gamma = real(acos(cos_gamma));  % óãîë ãàììà (â ëîêòåâîì øàðíèðå)


function R=Ry(q)
R=[cos(q)  0, sin(q);
     0     1,      0;
  -sin(q), 0, cos(q)];


function R=Rz(q)
R=[cos(q), -sin(q), 0;
   sin(q),  cos(q), 0;
        0,       0, 1];